### Link de Material Complementario
https://1drv.ms/f/s!Anh5cvrOJtUTk945Qm-ZqLdvg4BlNA?e=iVBhVm

In [2]:
import pandas as pd
import numpy as np

In [4]:
data = pd.read_csv('titanic.csv')
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

# Modulo 4.- Pandas 4

## 4.1. Operaciones aritméticas
Cuando realizamos operaciones entre series o dataframes,  todas las operaciones son alineadas según las etiquetas  (recordemos que en numpy la alineación es por la posición).

Consideremos dos series con la misma cantidad de  elementos pero que sólo comparten algunos índices. Si  realizamos la suma de las series los elementos, se van a  sumar sólo si comparten el mismo índice.

En el caso de que haya índices que estén presentes en una  serie pero no en la otra, los elementos se van a completar  con NaN de modo que la nueva serie tenga todos los índices  de ambas series.

In [3]:
s1 = pd.Series([5, 7, 2, 8, 0, 1])
s2 = pd.Series([17, 4, 1, 0, 0, 1], index = [3, 4, 5, 6, 7, 8])

In [4]:
s1

0    5
1    7
2    2
3    8
4    0
5    1
dtype: int64

In [5]:
s2

3    17
4     4
5     1
6     0
7     0
8     1
dtype: int64

In [6]:
s1 + s2

0     NaN
1     NaN
2     NaN
3    25.0
4     4.0
5     2.0
6     NaN
7     NaN
8     NaN
dtype: float64

## 4.2. Alineación
Con dataframes la alineación sucede tanto en  ﬁlas como en columnas.

In [7]:
array1 = np.random.randint(0, 50, (6,4))
array2 = np.random.randint(0, 50, (6,4))

In [8]:
df1 = pd.DataFrame(array1, columns = ['A', 'B', 'C', 'D'] )
df1

    A   B   C   D
0  30  12  33  24
1  48  23  24  41
2  13  27  20  23
3  15  40  44  25
4  19   9  37   3
5  49   3  10  14

In [9]:
df2 = pd.DataFrame(array2, index = [3, 4, 5, 6, 7, 8], columns = ['C', 'D', 'E', 'F'] )
df2

    C   D   E   F
3  37  19  40  13
4  35  30  18   8
5   5   2  12  30
6   0  35  42  45
7   9  13  32  14
8  13  14  44  22

In [10]:
df1 +df2

    A   B     C     D   E   F
0 NaN NaN   NaN   NaN NaN NaN
1 NaN NaN   NaN   NaN NaN NaN
2 NaN NaN   NaN   NaN NaN NaN
3 NaN NaN  81.0  44.0 NaN NaN
4 NaN NaN  72.0  33.0 NaN NaN
5 NaN NaN  15.0  16.0 NaN NaN
6 NaN NaN   NaN   NaN NaN NaN
7 NaN NaN   NaN   NaN NaN NaN
8 NaN NaN   NaN   NaN NaN NaN

In [11]:
df3 = df1 + df2

In [28]:
df4 =df3.dropna(how = "all")
df4 = df4.dropna(axis=1)
df4

      C     D
3  81.0  44.0
4  72.0  33.0
5  15.0  16.0

## 4.3. Operaciones
Podemos operar entre dos columnas de un  dataframe. En este caso se comparte el índice, por  lo que todos los datos se encuentran alineados.

Sólo si alguno de los valores es NaN el resultado  correspondiente también lo será.
Estas operaciones generan una nueva serie, que  se puede usar para crear una nueva columna en el  dataframe o para reemplazar una existente. Esto  se logra con una asignación directa.

In [29]:
df1['A'] + df1['B']

0    42
1    71
2    40
3    55
4    28
5    52
dtype: int32

In [30]:
df1['E'] = df1['A'] + df1['B']

df1

    A   B   C   D   E
0  30  12  33  24  42
1  48  23  24  41  71
2  13  27  20  23  40
3  15  40  44  25  55
4  19   9  37   3  28
5  49   3  10  14  52

## 4.4. Metodos asociados
Todos los operadores tienen métodos asociados que permiten  realizar la misma operación. Sin embargo, los métodos ofrecen  la posibilidad de controlar ciertos parámetros, dando más  ﬂexibilidad a la hora de hacer las operaciones.

Por ejemplo, el parámetro fill_value completa los NaN  existentes en los objetos antes de la operación. También utiliza  este valor para cualquier alineación que sea necesaria (en caso  de que no exista la etiqueta en una de las estructuras).

![imagen](metodos.png)

In [31]:
s1.add(s2)

0     NaN
1     NaN
2     NaN
3    25.0
4     4.0
5     2.0
6     NaN
7     NaN
8     NaN
dtype: float64

In [32]:
s1.add(s2, fill_value = 0)

0     5.0
1     7.0
2     2.0
3    25.0
4     4.0
5     2.0
6     0.0
7     0.0
8     1.0
dtype: float64

Los métodos asociados también permiten controlar cómo se  realiza el **broadcasting** entre dataframes y series.
En este caso la alineación por defecto es por columnas, es decir  que al hacer la operación se van a comparar los índices de la  serie con las columnas del dataframe. Si sumamos directamente  un dataframe con una de sus columnas (y los índices de las ﬁlas  son distintos de las columnas), ningún dato se va a encontrar  alineado. Para controlar que la alineación se haga por ﬁlas  podemos usar el método con el parámetro axis = index.

In [33]:
df1 + df1['A']

    A   B   C   D   E   0   1   2   3   4   5
0 NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN
4 NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN
5 NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN NaN

In [34]:
df1.add(df1['A'], axis = 'index')

    A   B   C   D    E
0  60  42  63  54   72
1  96  71  72  89  119
2  26  40  33  36   53
3  30  55  59  40   70
4  38  28  56  22   47
5  98  52  59  63  101

## 4.5. Comparaciones
También existen los operadores de comparación y  sus métodos correspondientes. El comportamiento es  similar al de los operadores y métodos aritméticos.
Estas operaciones producen estructuras de booleanos  que luego se pueden utilizar para hacer ﬁltros.
Para producir ﬁltros más complejos tenemos que ser  capaces de combinar comparaciones. Los operadores  and, or y not no funcionan con series o dataframes.  Para hacer operaciones lógicas elemento a elemento  hay que usar los operadores  &, | y ~.
Es importante usar paréntesis para agrupar  correctamente las operaciones ya que no tienen el  mismo orden de precedencia que los operadores  habituales.

In [35]:
df2

    C   D   E   F
3  37  19  40  13
4  35  30  18   8
5   5   2  12  30
6   0  35  42  45
7   9  13  32  14
8  13  14  44  22

In [36]:
df2[df2['C']>19]

    C   D   E   F
3  37  19  40  13
4  35  30  18   8

# Modulo 4.- Pandas 5

## 5.1. Estadisticas
Pandas provee numerosos métodos para realizar estadísticas  sobre los datos tanto en series como en dataframes. Por defecto,  estos métodos ignoran los missing values, no teniéndolos en  cuenta a la hora de realizar los cálculos. Si se usa el parámetro  skipna = False los valores NaN se propagan al resultado ﬁnal.
Cuando se trabaja con un dataframe, estas funciones se calculan  por columna y sólo las que tienen números y devuelven una serie.

Entre estos métodos podemos encontrar: **sum, mean, std, var,  mode, median, count, min, max, prod**

In [37]:
data.mean()

C:\Users\santi\AppData\Local\Temp\ipykernel_29636\531903386.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  data.mean()

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

In [38]:
# promedio y desviacion standar de las edades
data['Age'].mean(), data['Age'].std()

(29.69911764705882, 14.526497332334044)

In [39]:
# promedio de edad de los pasajeros de primera clase
data.loc[data["Pclass"] == 1, 'Age'].mean()

38.233440860215055

In [40]:
# promedio de edad de las mujeres de primera clase
data.loc[(data["Pclass"] == 1) & (data["Sex"] == 'female') , 'Age'].mean()

34.61176470588235

In [41]:
# contar cantidad de varones
data.loc[data["Sex"] == 'male', "Sex"].count()

577

In [42]:
data['Age'].min(), data['Age'].max()

(0.42, 80.0)

## 5.2. describe()
El método describe permite ver un resumen de las  estadísticas principales de cada columna.
Cuando la columna es **numérica** devuelve: cantidad de  elementos válidos, promedio, desviación standard,  mínimo, máximo y cuartiles.

Cuando la columna **no es numérica** devuelve: cantidad  de elementos válidos, cantidad de elementos únicos y el  elemento más frecuente y su frecuencia.

Cuando el dataframe incluye **columnas numéricas y no  numéricas**, el método sólo muestra el resumen de las  columnas numéricas. Este comportamiento se puede  controlar con los parámetros include/exclude.

In [43]:
data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [44]:
data['Embarked'].describe()

count     889
unique      3
top         S
freq      644
Name: Embarked, dtype: object

## 5.3. aggregate()
El método aggregate (con el alias agg) permite hacer  un resumen con las funciones de agregación que  querramos. Se le puede pasar como argumentos un  string con el nombre de la función o la función en sí  (que puede incluir funciones de numpy).
En principio estas funciones se calculan sobre todas las  columnas, lo que puede causar resultados inesperados.  Por ejemplo, la función sum aplicada a strings, los  concatena todos. Se pueden seleccionar las columnas  numéricas con el método select_dtypes.

In [45]:
data.select_dtypes('number').aggregate(['sum', 'min', np.max, 'var'])

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
sum,397386.0,342.000000,2057.000000,21205.170000,466.000000,340.000000,28693.949300
min,1.0,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
amax,891.0,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200
var,66231.0,0.236772,0.699015,211.019125,1.216043,0.649728,2469.436846

## 5.4. value_counts()
El método value_counts para series permite encontrar  una distribución de frecuencias de los valores únicos que  contiene. Devuelve una serie cuyos índices son los valores  únicos de la serie original y sus valores son las respectivas  frecuencias.

El resultado está ordenado de mayor a menor, de modo  que el primer elemento es el más frecuente.
Se puede hacer que se ordene en orden ascendente con  el parámetro ascending.
El parámetro normalize permite obtener las proporciones  de cada valor.

In [3]:
s = pd.Series([1, 2, 1, 3, 5, 2, 1, 1, 4, 4, 1])
s.value_counts()

1    5
2    2
4    2
3    1
5    1
dtype: int64

In [5]:
s.value_counts(normalize = True, sort = False)

1    0.454545
2    0.181818
3    0.090909
5    0.090909
4    0.181818
dtype: float64

In [6]:
# para mostrar el resultado en formato de %
s1 =s.value_counts(normalize = True, sort = True)
s2 =pd.DataFrame(s1,columns = ['Columna 1'])

s2= s2['Columna 1'] .apply(lambda x: format(x, '.2%'))
s2

1    45.45%
2    18.18%
4    18.18%
3     9.09%
5     9.09%
Name: Columna 1, dtype: object